import gbjd from '../assets/images/gbjd_250-200px.png'
import bbj from '../assets/images/bbj_250-200px.png'
import hgr from '../assets/images/hgr_250-200px.png'
import yxrs from '../assets/images/yxrs_250-200px.png'


const chineseFoodTabs = [
  {
    title: '川菜',
    key: 'cuncai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: bbj,
        description: {
          title: '棒棒鸡',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: hgr,
        description: {
          title: '回锅肉',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '鱼香肉丝',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '鲁菜',
    key: 'lucai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '鲁菜1',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: hgr,
        description: {
          title: '鲁菜2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: bbj,
        description: {
          title: '鲁菜3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: gbjd,
        description: {
          title: '鲁菜4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '粤菜',
    key: 'yuecai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: gbjd,
        description: {
          title: '粤菜1',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: bbj,
        description: {
          title: '粤菜2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: hgr,
        description: {
          title: '粤菜3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '粤菜4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '苏菜',
    key: 'sucai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '苏菜1',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: hgr,
        description: {
          title: '苏菜2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: bbj,
        description: {
          title: '苏菜3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: gbjd,
        description: {
          title: '苏菜4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '浙菜',
    key: 'zhecai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: gbjd,
        description: {
          title: '浙菜1',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: bbj,
        description: {
          title: '浙菜2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: hgr,
        description: {
          title: '浙菜3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '浙菜4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '闽菜',
    key: 'mincai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '闽菜1',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: hgr,
        description: {
          title: '闽菜2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: bbj,
        description: {
          title: '闽菜3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: gbjd,
        description: {
          title: '闽菜4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '湘菜',
    key: 'xiangcai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: gbjd,
        description: {
          title: '湘菜1',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: bbj,
        description: {
          title: '湘菜2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: hgr,
        description: {
          title: '湘菜3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '湘菜4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '徽菜',
    key: 'huicai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '徽菜1',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: hgr,
        description: {
          title: '徽菜2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: bbj,
        description: {
          title: '徽菜3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: gbjd,
        description: {
          title: '徽菜4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
]
export default chineseFoodTabs