import img1 from '../assets/images/img1.png';
import img2 from '../assets/images/img2.png';

const searchTabs = [
  {
    title: '搜索结果',
    key: 'ssjg',
    itemPerPage: 4,
    items: [
      {
        img: {
          src: img1,
          alt: img1,
        },
        title: '养生水果，你知道多少？',
        time: '15分钟前',
        description: '水果是平时家中必不可少的东西，可是很多人只单单是为了口感，或者是补充维生素，大部分的水果都能做到。但有的人吃水果却能增强免疫力，减少生病，把水果当成“保养剂”来吃了，你是哪一种呢？',
        path: '/search',
      },
      {
        img: {
          src: img2,
          alt: img2,
        },
        title: '夏天到了，教你做一杯养生冷饮',
        time: '1分钟前',
        description: '夏天，相信每个人心目中都有属于自己的纳凉美景，躺在沙滩上，吹着凉爽的海风，喝着冷饮，如此惬意场景每个人都渴望拥有，但现实是很残酷的，不是每个人都可以有这样的时间、精力、财力，所以很多人只能选择在家里吹这风扇来降暑，不过这个时候要是来一杯冰爽的冷饮也是惬意的，但外面的冷饮含有很多添加剂，不利于身体健康，所以还是自己在家中制作冷饮比较妥当，今天小编给大家介绍下适合夏季的美味冷饮都有哪些，顺带制作方法。',
        path: '/search',
      },
      {
        img: {
          src: img1,
          alt: img1,
        },
        title: '养生水果，你知道多少？',
        time: '15分钟前',
        description: '水果是平时家中必不可少的东西，可是很多人只单单是为了口感，或者是补充维生素，大部分的水果都能做到。但有的人吃水果却能增强免疫力，减少生病，把水果当成“保养剂”来吃了，你是哪一种呢？',
        path: '/search',
      },
      {
        img: {
          src: img2,
          alt: img2,
        },
        title: '夏天到了，教你做一杯养生冷饮',
        time: '1分钟前',
        description: '夏天，相信每个人心目中都有属于自己的纳凉美景，躺在沙滩上，吹着凉爽的海风，喝着冷饮，如此惬意场景每个人都渴望拥有，但现实是很残酷的，不是每个人都可以有这样的时间、精力、财力，所以很多人只能选择在家里吹这风扇来降暑，不过这个时候要是来一杯冰爽的冷饮也是惬意的，但外面的冷饮含有很多添加剂，不利于身体健康，所以还是自己在家中制作冷饮比较妥当，今天小编给大家介绍下适合夏季的美味冷饮都有哪些，顺带制作方法。',
        path: '/search',
      },
      {
        img: {
          src: img2,
          alt: img2,
        },
        title: '夏天到了，教你做一杯养生冷饮',
        time: '1分钟前',
        description: '夏天，相信每个人心目中都有属于自己的纳凉美景，躺在沙滩上，吹着凉爽的海风，喝着冷饮，如此惬意场景每个人都渴望拥有，但现实是很残酷的，不是每个人都可以有这样的时间、精力、财力，所以很多人只能选择在家里吹这风扇来降暑，不过这个时候要是来一杯冰爽的冷饮也是惬意的，但外面的冷饮含有很多添加剂，不利于身体健康，所以还是自己在家中制作冷饮比较妥当，今天小编给大家介绍下适合夏季的美味冷饮都有哪些，顺带制作方法。',
        path: '/search',
      },
      {
        img: {
          src: img1,
          alt: img1,
        },
        title: '养生水果，你知道多少？',
        time: '15分钟前',
        description: '水果是平时家中必不可少的东西，可是很多人只单单是为了口感，或者是补充维生素，大部分的水果都能做到。但有的人吃水果却能增强免疫力，减少生病，把水果当成“保养剂”来吃了，你是哪一种呢？',
        path: '/search',
      },
      {
        img: {
          src: img2,
          alt: img2,
        },
        title: '夏天到了，教你做一杯养生冷饮',
        time: '1分钟前',
        description: '夏天，相信每个人心目中都有属于自己的纳凉美景，躺在沙滩上，吹着凉爽的海风，喝着冷饮，如此惬意场景每个人都渴望拥有，但现实是很残酷的，不是每个人都可以有这样的时间、精力、财力，所以很多人只能选择在家里吹这风扇来降暑，不过这个时候要是来一杯冰爽的冷饮也是惬意的，但外面的冷饮含有很多添加剂，不利于身体健康，所以还是自己在家中制作冷饮比较妥当，今天小编给大家介绍下适合夏季的美味冷饮都有哪些，顺带制作方法。',
        path: '/search',
      },
    ]
  },
]
export default searchTabs