import gbjd from '../../chinese_food/assets/images/gbjd_250-200px.png'
import bbj from '../../chinese_food/assets/images/bbj_250-200px.png'
import hgr from '../../chinese_food/assets/images/hgr_250-200px.png'
import yxrs from '../../chinese_food/assets/images/yxrs_250-200px.png'


const chineseFoodTabs = [
  {
    title: '川菜',
    key: 'cuncai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁5',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁6',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '鲁菜',
    key: 'lucai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁5',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁6',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '粤菜',
    key: 'yuecai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁5',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁6',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '苏菜',
    key: 'cucai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁5',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁6',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '浙菜',
    key: 'zhecai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁5',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁6',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '闽菜',
    key: 'mincai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁5',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁6',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '湘菜',
    key: 'xiangcai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁5',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁6',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '徽菜',
    key: 'huicai',
    itemPerPage: 2,
    items: [
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁5',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook',
        imgSrc: gbjd,
        description: {
          title: '宫保鸡丁6',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
]
export default chineseFoodTabs