import yxrs from '../assets/images/yxrs_250-200.png'
import ss from '../assets/images/ss_250-200.png'
import syp from '../assets/images/syp_250-200.png'
import tfl from '../assets/images/tfl_250-200.png'




const foreignFoodTabs = [
  {
    title: '日本料理',
    key: 'rbll',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: ss,
        description: {
          title: '寿司',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: syp,
        description: {
          title: '生鱼片',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: tfl,
        description: {
          title: '天妇罗',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '甜酱鱼丝',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '韩国料理',
    key: 'hgll',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '韩国料理1',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: tfl,
        description: {
          title: '韩国料理2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: syp,
        description: {
          title: '韩国料理3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: ss,
        description: {
          title: '韩国料理4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '法国料理',
    key: 'fgll',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: ss,
        description: {
          title: '法国料理1',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: syp,
        description: {
          title: '法国料理2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: tfl,
        description: {
          title: '法国料理3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '法国料理4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '泰国料理',
    key: 'tgll',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '泰国料理1',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: tfl,
        description: {
          title: '泰国料理2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: syp,
        description: {
          title: '泰国料理3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: ss,
        description: {
          title: '泰国料理4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '越南料理',
    key: 'ynll',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: ss,
        description: {
          title: '越南料理1',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: syp,
        description: {
          title: '越南料理2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: tfl,
        description: {
          title: '越南料理3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '越南料理4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
  {
    title: '缅甸料理',
    key: 'mdll',
    itemPerPage: 2,
    items: [
      {
        path: '/cook/food/0',
        imgSrc: yxrs,
        description: {
          title: '缅甸料理1',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: tfl,
        description: {
          title: '缅甸料理2',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: syp,
        description: {
          title: '缅甸料理3',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
      {
        path: '/cook/food/0',
        imgSrc: ss,
        description: {
          title: '缅甸料理4',
          material: '原料: 鸡胸肉（或鸡腿肉）、酒鬼花生米（或油炸花生米），鸡蛋一个',
          ingredients: '配料: 葱、姜、蒜、干辣椒、盐、味精、豆腐浆',
          cookBook: [
            '1、主要材料备齐；',
            '2、黄瓜洗净切丁，葱段切丁，老姜、蒜切片备用；',
            '3、鸡腿剔骨；',
            '4、鸡腿肉在清水中泡1个小时泡去血水，中间换一次水；',
            '5、鸡腿肉沥干后切成菱形肉块',
            '6、放入盐、老抽、料酒拌匀后，再加入少许蛋清、水淀粉、白胡椒粉，搅拌均匀备用；',
            '7、取一个空碗，加入少许盐、糖25克、醋20克、老抽少许、料酒少许、胡椒粉少许、水淀粉少许，调匀备用；',
          ]
        }
      },
    ]
  },
]
export default foreignFoodTabs